%%湖北红十字
b=[7	31	42767.3	1876.2	44643.5
6	30	36069.3	1836.2	37905.5
5	29      28017.1	1699.5	29716.6
4	28	19549.8	1663.5	21213.3
3	27	26764.5	2248.7	29013.1
2	26	8673.8	875.4	9549.2
1	25	5541.4	856.3	6397.7];

b=xlsread('wuhan_redcorss_2_5.xlsx');
[x,s]=size(b);
 
high(:,1) = flipud(b(:,3))./10000;
high(:,2) = flipud(b(:,4))./10000;
bar(high,'stacked')

set(gca,'xticklabel',{'1月25日','1月26日','1月27日','1月28日','1月29日','1月30日','1月31日'});

grid on
title('湖北省红十字会 收到捐赠情况')
ylabel('金额（亿）')
legend({'累计收到现金','累计收到物资'},'Location','northwest')